# DP 
- Dynamic Programming 동적계획법
- DC(Divide and Conquer)와 유사하게, 문제를 여러 작은 문제로 나누어 재귀적으로 해결하는 방법
- (차이) 큰 문제의 해답이 작은 문제의 해답들의 식으로 표현되는데, 그 답이 필요할 때 재귀적으로 얻는 것이 아니라 미리 계산하여 기록해놓은 값을 재귀 식에 따라 계산하는 것!
- (예) 피노바치 수 계산 중
```
# DC
1. 작은 문제 F(n-1)과 F(n-2)를 함수 재귀 호출하여 
2. F(n-1)+F(n-2)로 계산하여 구함
# DP
1. 배열 F[]의 F[n-1]과 F[n-2]에 작은 문제 답을 미리 계산하여 저장 후
2. F[n] = F[n-1]+F[n-2]로 계산하여 구함
```
- DP는 원래 문제의 답을 작은 문제들의 재귀 식으로 표현하는 것이 핵심!!

### 계단 오르기
```py
# 1, 2칸씩 오르기 
# 1층 -> n층까지 오르는 경우의 수 
# A[n] = 1 -> n 
A[1] = 1
A[2] = 1
A[3] = 2
# n층에 오르는 경우의 수 : 2가지
A[n] = (1->n-1)에 이르는 경우의 수 + (1->n-2)경우의 수
A[n] = A[n-1] + A[n-2] # 점화식, 피보나치수 
```